code-review/NRB_3471_3546/База_Было/DataProcessors/СозданиеРСВПоСобраниям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СозданиеРСВПоСобраниям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаКД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КД</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСВ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоздатьРСВ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументКДПроведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ЮридическиеЛицаМеждународныеКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЮридическиеЛицаМеждународныеКомпании</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакРегистрацииМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакРегистрацииМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/СозданиеРСВПоСобраниям/Ext/ObjectModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура СоздатьРСВ() Экспорт
	ТекущаяДата = ТекущаяДатаСеанса();
	ДатаРСВ = ОбщегоНазначения.ДобавитьРабочийДень(Период.ДатаОкончания, 1);
	Если ДатаРСВ = НачалоДня(ТекущаяДата) Тогда
		ТекущееВремя = ТекущаяДата - НачалоДня(ТекущаяДата);
		ДатаРСВСоВременем = ДатаРСВ + ТекущееВремя;
	Иначе
		Часы = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("2257.ВремяВЧасахДляСозданияРСВПоСобраниям");
		СекундВЧасе = 3600;
		ДатаРСВСоВременем = ДатаРСВ + Часы * СекундВЧасе;
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаКД Цикл
		
		Если Не Строка.СоздатьРСВ Тогда
			Продолжить;
		КонецЕсли;
		
		РСВ = Документы.РаскрытиеСпискаВладельцев.СоздатьДокумент();
		РСВ.Заполнить(Строка.КД);
		РСВ.Дата = ДатаРСВСоВременем;
		РСВ.Записать();
		Если Не Строка.ДокументКДПроведен Тогда
			КД = Строка.КД.ПолучитьОбъект();
			Попытка
				КД.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ЗаписьЖурналаРегистрации(ОписаниеОшибки(), УровеньЖурналаРегистрации.Ошибка);
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Процедура Заполнить() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорпоративноеДействие_Новый.Ссылка КАК КД,
	|	КорпоративноеДействие_Новый.ЦеннаяБумага1 КАК ЦБ,
	|	КорпоративноеДействие_Новый.СчетДЕПО КАК СчетДепоМХ,
	|	КорпоративноеДействие_Новый.ДатаФиксации КАК ДатаФиксации
	|ПОМЕСТИТЬ КорпоративныеДействия
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЮридическиеЛицаМеждународныеКомпании.СрезПоследних(&ДатаОкончания, ) КАК МеждународныеКомпанииСрезПоследних
	|		ПО КорпоративноеДействие_Новый.ЦеннаяБумага1.Эмитент.ЮридическиеФизическиеЛица = МеждународныеКомпанииСрезПоследних.ЮридическоеЛицо
	|ГДЕ
	|	НЕ КорпоративноеДействие_Новый.ПометкаУдаления
	|	И КорпоративноеДействие_Новый.ВидКД.Код В(&КодыВидовКДСобрание)
	|	И КорпоративноеДействие_Новый.ДатаФиксации МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (НЕ КорпоративноеДействие_Новый.ЦеннаяБумага1.ВидЦББанкаРоссии.ИностраннаяЦБ
	|			ИЛИ КорпоративноеДействие_Новый.ЦеннаяБумага1.Эмитент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|				И КорпоративноеДействие_Новый.ЦеннаяБумага1.Эмитент.ЮридическиеФизическиеЛица.Страна = &Россия
	|				И ЕСТЬNULL(МеждународныеКомпанииСрезПоследних.МеждународнаяКомпания, ЛОЖЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиИОборотыЦБ.Период КАК Период,
	|	ОстаткиИОборотыЦБ.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиИОборотыЦБ.ЦБ КАК ЦБ,
	|	ОстаткиИОборотыЦБ.КоличествоКонечныйОстаток КАК КонечныйОстаток,
	|	ОстаткиИОборотыЦБ.КоличествоОборот КАК Оборот
	|ПОМЕСТИТЬ ОстаткиИОборотыЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.ОстаткиИОбороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			День,
	|			,
	|			(СчетДепоМХ, ЦБ) В
	|				(ВЫБРАТЬ
	|					КорпоративныеДействия.СчетДепоМХ КАК СчетДЕПО,
	|					КорпоративныеДействия.ЦБ КАК ЦеннаяБумага
	|				ИЗ
	|					КорпоративныеДействия КАК КорпоративныеДействия)) КАК ОстаткиИОборотыЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорпоративныеДействия.КД КАК КД,
	|	СУММА(ВЫБОР
	|			КОГДА ОстаткиИОборотыЦБ.Период = &ДатаНачала
	|				ТОГДА ОстаткиИОборотыЦБ.КонечныйОстаток
	|			ИНАЧЕ ОстаткиИОборотыЦБ.Оборот
	|		КОНЕЦ) КАК ОстатокНаДатуФиксации
	|ПОМЕСТИТЬ КДсОстаткамиНаДатуФиксации
	|ИЗ
	|	КорпоративныеДействия КАК КорпоративныеДействия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиИОборотыЦБ КАК ОстаткиИОборотыЦБ
	|		ПО КорпоративныеДействия.ЦБ = ОстаткиИОборотыЦБ.ЦБ
	|			И КорпоративныеДействия.СчетДепоМХ = ОстаткиИОборотыЦБ.СчетДепоМХ
	|			И КорпоративныеДействия.ДатаФиксации >= ОстаткиИОборотыЦБ.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	КорпоративныеДействия.КД
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА ОстаткиИОборотыЦБ.Период = &ДатаНачала
	|				ТОГДА ОстаткиИОборотыЦБ.КонечныйОстаток
	|			ИНАЧЕ ОстаткиИОборотыЦБ.Оборот
	|		КОНЕЦ) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КДсОстаткамиНаДатуФиксации.КД КАК КД,
	|	МАКСИМУМ(РаскрытиеСпискаВладельцев.Дата) КАК Дата
	|ПОМЕСТИТЬ МаксимальныеДатыРСВПоКД
	|ИЗ
	|	КДсОстаткамиНаДатуФиксации КАК КДсОстаткамиНаДатуФиксации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|		ПО КДсОстаткамиНаДатуФиксации.КД = РаскрытиеСпискаВладельцев.КарточкаКД
	|			И (НЕ РаскрытиеСпискаВладельцев.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	КДсОстаткамиНаДатуФиксации.КД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеДатыРСВПоКД.КД КАК КД,
	|	МаксимальныеДатыРСВПоКД.КД.Проведен КАК ДокументКДПроведен,
	|	МАКСИМУМ(РаскрытиеСпискаВладельцев.Ссылка) КАК РСВ,
	|	МАКСИМУМ(РаскрытиеСпискаВладельцев.Ссылка ЕСТЬ NULL) КАК СоздатьРСВ
	|ИЗ
	|	МаксимальныеДатыРСВПоКД КАК МаксимальныеДатыРСВПоКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|		ПО МаксимальныеДатыРСВПоКД.КД = РаскрытиеСпискаВладельцев.КарточкаКД
	|			И МаксимальныеДатыРСВПоКД.Дата = РаскрытиеСпискаВладельцев.Дата
	|			И (НЕ РаскрытиеСпискаВладельцев.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныеДатыРСВПоКД.КД,
	|	МаксимальныеДатыРСВПоКД.КД.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	СоздатьРСВ УБЫВ,
	|	МаксимальныеДатыРСВПоКД.КД.Дата";
	
	КодыВидовКД = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("2257.КодыВидовКДДляСозданияРСВПоСобраниям");
	Запрос.УстановитьПараметр("КодыВидовКДСобрание", СтрРазделить(КодыВидовКД, ", ", Ложь));
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Россия", Справочники.КлассификаторСтранМира.РОССИЯ);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаКД.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

#КонецОбласти 

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
